In [1]:
#import libs

import pandas as pd

In [2]:
df = pd.read_csv("homeprices.csv")

In [3]:
df.head()

              town  area   price
0  monroe township  2600  550000
1  monroe township  3000  565000
2  monroe township  3200  610000
3  monroe township  3600  680000
4  monroe township  4000  725000

## Dummy Variable

In [4]:
dummies = pd.get_dummies(df['town'])
dummies

    monroe township  robinsville  west windsor
0                 1            0             0
1                 1            0             0
2                 1            0             0
3                 1            0             0
4                 1            0             0
5                 0            0             1
6                 0            0             1
7                 0            0             1
8                 0            0             1
9                 0            1             0
10                0            1             0
11                0            1             0
12                0            1             0

In [5]:
merged = pd.concat([df,dummies],axis=1)
merged

               town  area   price  monroe township  robinsville  west windsor
0   monroe township  2600  550000                1            0             0
1   monroe township  3000  565000                1            0             0
2   monroe township  3200  610000                1            0             0
3   monroe township  3600  680000                1            0             0
4   monroe township  4000  725000                1            0             0
5      west windsor  2600  585000                0            0             1
6      west windsor  2800  615000                0            0             1
7      west windsor  3300  650000                0            0             1
8      west windsor  3600  710000                0            0             1
9       robinsville  2600  575000                0            1             0
10      robinsville  2900  600000                0            1             0
11      robinsville  3100  620000                0            1             0
12      robinsville  3600  695000                0            1             0

## Drop the original categorical column and drop  any one of the dummy variable column

In [6]:
final = merged.drop(['town','west windsor'],axis=1)
final

    area   price  monroe township  robinsville
0   2600  550000                1            0
1   3000  565000                1            0
2   3200  610000                1            0
3   3600  680000                1            0
4   4000  725000                1            0
5   2600  585000                0            0
6   2800  615000                0            0
7   3300  650000                0            0
8   3600  710000                0            0
9   2600  575000                0            1
10  2900  600000                0            1
11  3100  620000                0            1
12  3600  695000                0            1

In [7]:
from sklearn.linear_model import LinearRegression
model = LinearRegression()

In [8]:
X =  final.drop('price',axis=1) #Drop price from X because price is the dependent
X                                # variable

    area  monroe township  robinsville
0   2600                1            0
1   3000                1            0
2   3200                1            0
3   3600                1            0
4   4000                1            0
5   2600                0            0
6   2800                0            0
7   3300                0            0
8   3600                0            0
9   2600                0            1
10  2900                0            1
11  3100                0            1
12  3600                0            1

In [9]:
y = final.price

In [10]:
model.fit(X,y)

LinearRegression()

In [11]:
model.predict([[2800,0,1]])

C:\Users\risha\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([590775.63964739])

In [12]:
model.predict([[3400,0,0]])

C:\Users\risha\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([681241.66845839])

## Label Encoder

In [13]:
#first do Label Encoding

In [14]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

In [15]:
dfle = df
dfle.town = le.fit_transform(dfle.town)
dfle.town

0     0
1     0
2     0
3     0
4     0
5     2
6     2
7     2
8     2
9     1
10    1
11    1
12    1
Name: town, dtype: int32

In [16]:
X = df[['town','area']].values #We get 2D array if we use .values
X

array([[   0, 2600],
       [   0, 3000],
       [   0, 3200],
       [   0, 3600],
       [   0, 4000],
       [   2, 2600],
       [   2, 2800],
       [   2, 3300],
       [   2, 3600],
       [   1, 2600],
       [   1, 2900],
       [   1, 3100],
       [   1, 3600]], dtype=int64)

In [17]:
y = dfle.price
y

0     550000
1     565000
2     610000
3     680000
4     725000
5     585000
6     615000
7     650000
8     710000
9     575000
10    600000
11    620000
12    695000
Name: price, dtype: int64

In [18]:
model1 = LinearRegression()

In [19]:
model1.fit(X,y)

LinearRegression()

In [20]:
model1.predict([[2,2800]])

array([607256.32819319])

In [21]:
model1.predict([[0,2600]])

array([541819.90107652])

In [22]:
model1.score(X,y)

0.9552018104317441

## One Hot Encoder

In [23]:
#using pandas get_dummies(data,columns,drop_first,dummy_na)

In [26]:
df.town = df.town.astype('category')

In [27]:
dfohe =  pd.get_dummies(df, prefix='town',drop_first=False)

In [28]:
dfohe #onehotencoded data frame

    area   price  town_0  town_1  town_2
0   2600  550000       1       0       0
1   3000  565000       1       0       0
2   3200  610000       1       0       0
3   3600  680000       1       0       0
4   4000  725000       1       0       0
5   2600  585000       0       0       1
6   2800  615000       0       0       1
7   3300  650000       0       0       1
8   3600  710000       0       0       1
9   2600  575000       0       1       0
10  2900  600000       0       1       0
11  3100  620000       0       1       0
12  3600  695000       0       1       0